# PANDAS

In [1]:
import pandas as pd
import numpy as np

# Panda Data Structure Series DataFrame
                             series

In [2]:
s1=pd.Series([11,22,33,44,55,66,77,88,99])
s1
#PAndas series Object

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
dtype: int64

In [3]:
#index(0-9 default index given by series object)

In [4]:
s1[8] #Accessing value by index

99

In [5]:
s1[[2,4,7,8,0]] #Accesing multiple values

2    33
4    55
7    88
8    99
0    11
dtype: int64

In [6]:
s1[5]=3333  #MOdifying a value in a series
s1

0      11
1      22
2      33
3      44
4      55
5    3333
6      77
7      88
8      99
dtype: int64

In [7]:
del s1[4] #deleting a Value
s1

0      11
1      22
2      33
3      44
5    3333
6      77
7      88
8      99
dtype: int64

In [8]:
s1[[2,3,6]]=[21,22,23] #MOdifying Multiple Value
s1

0      11
1      22
2      21
3      22
5    3333
6      23
7      88
8      99
dtype: int64

In [9]:
s1[99]=444  #For Inserting An Value
s1

0       11
1       22
2       21
3       22
5     3333
6       23
7       88
8       99
99     444
dtype: int64

In [10]:
s2=pd.Series([10,20,30,40],index=["oranges","apple","bananas","Kiwi"])  #we can give our own index and we can access 
                                                                        #by this like key but not have memory access
                                                                        #Can be Strong or Integer
s2

oranges    10
apple      20
bananas    30
Kiwi       40
dtype: int64

In [11]:
s2.index

Index(['oranges', 'apple', 'bananas', 'Kiwi'], dtype='object')

In [12]:
s2.values

array([10, 20, 30, 40], dtype=int64)

In [13]:
ourIndex=["oranges","apple","bananas","Kiwi"]
s2=pd.Series([10,20,30,40],index=ourIndex)
s2

oranges    10
apple      20
bananas    30
Kiwi       40
dtype: int64

In [14]:
s2>30 #give true where the condition satisfied and false otherwise

oranges    False
apple      False
bananas    False
Kiwi        True
dtype: bool

In [15]:
s2[s2>30]  #give only those records greater than 30

Kiwi    40
dtype: int64

In [16]:
s2[s2<30]  #give only those records less than 30

oranges    10
apple      20
dtype: int64

In [17]:
'peech' in s2  #Check if requirerd key is in the series or not

False

In [18]:
'oranges' in s2

True

# Creating a Series by using a dictionary

In [19]:
sdata={'Ohio':3500,'Texas':466777,'Oregon':977666.,'Utha':89782}
data=pd.Series(sdata)
data

Ohio        3500.0
Texas     466777.0
Oregon    977666.0
Utha       89782.0
dtype: float64

In [20]:
states=['Ohio','Oregon','Texas','Clifornia' ]
data1=pd.Series(sdata,index=states)
data1
data1.isnull()

Ohio         False
Oregon       False
Texas        False
Clifornia     True
dtype: bool

In [21]:
data1.notnull()

Ohio          True
Oregon        True
Texas         True
Clifornia    False
dtype: bool

In [22]:
#Since California is NaN we can assign the Value

In [23]:
data1['Clifornia']=7567
data1

Ohio           3500.0
Oregon       977666.0
Texas        466777.0
Clifornia      7567.0
dtype: float64

In [24]:
data1.isnull()

Ohio         False
Oregon       False
Texas        False
Clifornia    False
dtype: bool

# DATA FRAME

In [25]:
    data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
             'year': [2000, 2001, 2002, 2001, 2002, 2003],
              'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}


df1=pd.DataFrame(data)
df1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
df1[['pop']] #Selecting single column by column headers

   pop
0  1.5
1  1.7
2  3.6
3  2.4
4  2.9
5  3.2

In [27]:
df1.pop

<bound method NDFrame.pop of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

In [28]:
df1[['pop','state']] #selecting multiple column by column headers

   pop   state
0  1.5    Ohio
1  1.7    Ohio
2  3.6    Ohio
3  2.4  Nevada
4  2.9  Nevada
5  3.2  Nevada

In [29]:
del df1['pop']  #deleting column
df1

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [30]:
df1

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [31]:
 data = {'Subject': ['python', 'DataStructure', 'Database', 'OOP', 'Web Development', 'OS'],
             'Day': ['Mon','Tue','Wed','Thur','Fri','Sat'],
              'Marks': [60,80,79,90,87,88]}
df2=pd.DataFrame(data)
df2

           Subject   Day  Marks
0           python   Mon     60
1    DataStructure   Tue     80
2         Database   Wed     79
3              OOP  Thur     90
4  Web Development   Fri     87
5               OS   Sat     88

In [32]:
df2["gpa"]=3.8  #Adding single value to all column

In [33]:
df2

           Subject   Day  Marks  gpa
0           python   Mon     60  3.8
1    DataStructure   Tue     80  3.8
2         Database   Wed     79  3.8
3              OOP  Thur     90  3.8
4  Web Development   Fri     87  3.8
5               OS   Sat     88  3.8

In [34]:
df2["gpa"]=[3.4,3.5,3.6,3.7,3.8,3.9]  #Adding differnt value to all column
df2

           Subject   Day  Marks  gpa
0           python   Mon     60  3.4
1    DataStructure   Tue     80  3.5
2         Database   Wed     79  3.6
3              OOP  Thur     90  3.7
4  Web Development   Fri     87  3.8
5               OS   Sat     88  3.9

In [35]:
df2["Day"]=range(6) #give the range for the column

In [36]:
df2

           Subject  Day  Marks  gpa
0           python    0     60  3.4
1    DataStructure    1     80  3.5
2         Database    2     79  3.6
3              OOP    3     90  3.7
4  Web Development    4     87  3.8
5               OS    5     88  3.9

In [37]:
dic={"Ai for Everyone":[12,23,13,14,15,16],
     "Python1":[67,88,88,99,98,76],
     "Python2":[56,77,88,99,89,55]

    }
df=pd.DataFrame(dic,index=["wardha","omama","fatima","asma","rida","sana"])
df

        Ai for Everyone  Python1  Python2
wardha               12       67       56
omama                23       88       77
fatima               13       88       88
asma                 14       99       99
rida                 15       98       89
sana                 16       76       55

In [38]:
df["total"]=df["Ai for Everyone"] + df["Python1"] + df["Python2"]
df
del df["result"]

KeyError: 'result'

In [ ]:
df

In [ ]:
df["status"]=df["total"]>200
df

In [ ]:
for i in range(6):
    if df["status"][i] == False:
        df["status"][i]="pass"
    else:
        df["status"][i]="fail"
df

In [ ]:
numbers=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
evenarr=[]
oddarr=[]
for num in numbers:
    if num%2==0:
        evenarr.append(num)
    else:
        oddarr.append(num)
print(evenarr)
print(oddarr)

In [ ]:
[num for num in numbers  if num%2==0] #LIST COMPREHENSION

In [ ]:
df["status"]=["Pass" if marks>=200 else "Fail" for marks in df.total]
df

In [ ]:
df["percentage"]=[str(round(tot/250 * 100,2)) + "%" for tot in df.total]
df

In [ ]:
df["Statusbypercentage"]=["Pass" if round(tot/250 * 100,2)>33 else "Fail" for tot in df.total]
df

In [ ]:
df['perSubject']=["pass" if a>=16 and p1>=33 and p2>=33 else "Fails"
                 for a,p1,p2 in zip(df['Ai for Everyone'],df['Python1'],df['Python2'])]
df

In [ ]:
import numpy as np
df['persubject']=np.where(((df['Ai for Everyone']<33) & (df['Python1']<33) & (df['Python2']<33)),"fail","pass")
df

In [ ]:
a=list(range(5))      #Zip is making order pairs 
b=list(range(6))
c=zip(a,b)
for i in c:
    print(i)

In [ ]:
a=10
b=20
np.where(b>a,"Pass","Fail")

In [ ]:
import numpy as np
import pandas as pd

data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")
# in the loc method specify row label first 
# then specify column names
# remember! mutiple column names require array notation
#print( data_df.loc[['Colorado','Ohio'], ['two',  'three'] ] )
#print("\n")
print( data_df.iloc[2:, [3, 0, 1] ] ) # using number instead of labels
print( data_df.iloc[:])
print ( data_df.iloc[ :3 , :3 ] )
print( data_df.iloc[:, :3])

In [ ]:
import numpy as np
import pandas as pd

data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")


#You can drop values from the columns by passing axis=1 
#or axis='columns' :
data_df = data_df.drop('Colorado', axis=0)
#data_df.drop('two', axis=1, inplace = True)
print(data_df)

# if i want to remove a row for example 'Colorado', 
# how can we do that

In [ ]:
import numpy as np
import pandas as pd
frame  = pd.DataFrame(np.random.randn(4, 3), 
                             columns=list('bde'), 
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
print(frame)
#print(np.abs(frame))

#print(frame["d"]. min())
#print(frame["d"].max())
#print(frame["d"].max() - frame["d"]. min())

f = lambda x: x.max() - x.min() 

# df = frame.apply(f)
# print(df, type(df))

df = frame.apply(f, axis=1)
print(df)

In [ ]:
import numpy as np
import pandas as pd
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
print(frame)
# print()
# print(frame.sort_index(axis=1, ascending=True))
# print()
# print( frame.sort_index())
# defaults in sort: axis = 0, ascending = True

In [ ]:
print( frame.sort_values(by='b') )
print(frame.rank(ascending=False, method='max'))
print(frame.rank(ascending=True, method='min'))
print( frame.rank(axis='columns'))

In [ ]:
import numpy as np
import pandas as pd
states = pd.DataFrame(np.arange(9).reshape((3, 3) ),
index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

print(states)
# for your own working, run following statement without ffill
states = states.reindex(['a', 'b', 'c', 'd'])
print(states)

In [ ]:

# column name changing using reindex method
states = pd.DataFrame(np.arange(9).reshape((3, 3) ),
index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
print(states)
states_name = ['Texas', 'Utah', 'California','Ohio']

# can we use ffill parameter in column reindex mode ?
states =states.reindex(columns=states_name)
print(states)

In [ ]:
import numpy as np
import pandas as pd

data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
             index=['Ohio', 'Colorado', 'Utah', 'New York'],
             columns=['one', 'two', 'three', 'four'])

print(data_df, "\n")
# df2 = data_df[ ["one", "three"] ]
#print(df2)
#print( data_df[2:] ) # same like numpy
#print(data_df["one"] )# dicitonary like style of accessing data
#print(data_df.one[2:])  # filter on both row and column
# Conditonal Selection
#print ( data_df.three[data_df['three'] > 5] )
#print(data_df, "\n")

df2 = data_df["three"] > 5  # boolean dataframe
print(df2)
print( data_df[  data_df["three"] > 5  ] )

In [44]:
import pandas as pd;
#ummarizing and Computing Descriptive Statistics

df = pd.DataFrame([
                    [1.4, np.nan], [7.1, -4.5],
                    [np.nan, np.nan], [0.75, -1.3]
                   ], index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
print(df)
# print()
print( df.sum())
# print()
print( df.sum(axis='columns'))
# note: use of skipna

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3
one    9.25
two   -5.80
dtype: float64
a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64